name: "vehicle_plate_test"
layer {
  name: "data"
  type: "Python"
  top: "data"
  top: "label"
  python_param {
    module: "pythonLayer"
    layer: "PlateDataLayer"
    param_str: "{\'width\': 80, \'label_txt\': \'data/plate/test.txt\', \'train\': False, \'batch_size\': 512, \'height\': 30}"
  }
}
layer {
  name: "indicator"
  type: "ContinuationIndicator"
  top: "indicator"
  continuation_indicator_param {
    time_step: 80
    batch_size: 512
  }
}
layer {
  name: "permuted_data"
  type: "Permute"
  bottom: "data"
  top: "permuted_data"
  permute_param {
    order: 3
    order: 0
    order: 1
    order: 2
  }
}
layer {
  name: "lstm1"
  type: "LSTM"
  bottom: "permuted_data"
  bottom: "indicator"
  top: "lstm1"
  recurrent_param {
    num_output: 100
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "lstm2"
  type: "LSTM"
  bottom: "lstm1"
  bottom: "indicator"
  top: "lstm2"
  recurrent_param {
    num_output: 100
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "fc1"
  type: "InnerProduct"
  bottom: "lstm2"
  top: "fc1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 34
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    axis: 2
  }
}
layer {
  name: "ctc_loss"
  type: "CtcLoss"
  bottom: "fc1"
  bottom: "label"
  top: "ctc_loss"
  loss_weight: 1.0
  ctc_loss_param {
    alphabet_size: 34
    time_step: 80
    blank_label: 10
  }
}
layer {
  name: "premuted_fc"
  type: "Permute"
  bottom: "fc1"
  top: "premuted_fc"
  permute_param {
    order: 1
    order: 0
    order: 2
  }
}
layer {
  name: "accuracy"
  type: "LabelsequenceAccuracy"
  bottom: "premuted_fc"
  bottom: "label"
  top: "accuracy"
  labelsequence_accuracy_param {
    blank_label: 10
  }
}

